Router>en
! Enter privileged EXEC mode

Router#config t
! Enter global configuration mode
Enter configuration commands, one per line.  End with CNTL/Z.

Router(config)#hostname R2
! Set the hostname of the router to "R2"

R1(config)#interface g0/0
! Enter interface configuration mode for GigabitEthernet0/0

R2(config-if)#ip address 10.1.1.2 255.255.255.252
! Assign IP address 10.1.1.2 with a subnet mask of 255.255.255.252 to interface g0/0

R2(config-if)#no shutdown
! Enable the interface g0/0

R2(config-if)#exit
! Exit interface configuration mode

R1(config)#interface g0/1
! Enter interface configuration mode for GigabitEthernet0/1

R2(config-if)#ip address 10.2.2.2 255.255.255.252
! Assign IP address 10.2.2.2 with a subnet mask of 255.255.255.252 to interface g0/1

R2(config-if)#no shutdown
! Enable the interface g0/1

R2(config-if)#exit
! Exit interface configuration mode

R2(config)#router ospf 1
! Enter OSPF configuration mode, process ID 1

R2(config-router)#network 10.1.1.0 0.0.0.3 area 0
! Define OSPF network 10.1.1.0/30 in area 0

R2(config-router)#network 10.2.2.0 0.0.0.3 area 0
! Define OSPF network 10.2.2.0/30 in area 0

R2(config-router)#exit
! Exit OSPF configuration mode

R2(config)#exit
! Exit global configuration mode

