Router>enable
! Enter privileged EXEC mode
Router#config t
! Enter global configuration mode
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R1
! Set the hostname of the router to "R1"
R1(config)#interface g0/0
! Enter interface configuration mode for GigabitEthernet0/0
R1(config-if)#ip address 10.1.1.1 255.255.255.252
! Assign IP address 10.1.1.1 with a subnet mask of 255.255.255.252 to interface g0/0
R1(config-if)#no shutdown
! Enable the interface g0/0
R1(config-if)#exit
! Exit interface configuration mode
R1(config)#interface g0/1
! Enter interface configuration mode for GigabitEthernet0/1
R1(config-if)#ip address 192.168.1.1 255.255.255.0
! Assign IP address 192.168.1.1 with a subnet mask of 255.255.255.0 to interface g0/1
R1(config-if)#no shutdown
! Enable the interface g0/1
R1(config-if)#exit
! Exit interface configuration mode
R1(config)#no ip domain-lookup
! Disable DNS lookups on the router to prevent delays when mistyping commands
R1(config-if)#exit
! Exit interface configuration mode
R1(config)#router ospf 1
! Enter OSPF configuration mode, process ID 1
R1(config-router)#network 192.168.1.0 0.0.0.255 area 0
! Define OSPF network 192.168.1.0/24 in area 0
R1(config-router)#network 10.1.1.0 0.0.0.3 area 0
! Define OSPF network 10.1.1.0/30 in area 0
R1(config-router)#
R1(config-router)#exit
! Exit OSPF configuration mode
R1(config-if)#
R1(config-if)#
R1(config-if)#exit
! Exit interface configuration mode
R1(config)#router ospf 1
! Re-enter OSPF configuration mode, process ID 1
R1(config-router)#passive-interface g0/1
! Set interface g0/1 as a passive interface in OSPF to not send OSPF messages
R1(config-router)#exit
! Exit OSPF configuration mode
R1(config)#exit
! Exit global configuration mode
R1#
R1#show ip ospf neighbor
! Display OSPF neighbors' information

Neighbor ID     Pri   State           Dead Time   Address         Interface
10.2.2.2          1   FULL/BDR        00:00:39    10.1.1.2        GigabitEthernet0/0
! The above output shows a neighbor with ID 10.2.2.2 on interface GigabitEthernet0/0

R1#show ip route
! Display the current routing table

Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/8 is variably subnetted, 3 subnets, 2 masks
C       10.1.1.0/30 is directly connected, GigabitEthernet0/0
! Directly connected network 10.1.1.0/30 on GigabitEthernet0/0
L       10.1.1.1/32 is directly connected, GigabitEthernet0/0
! Local interface address 10.1.1.1/32 on GigabitEthernet0/0
O       10.2.2.0/30 [110/2] via 10.1.1.2, 00:06:31, GigabitEthernet0/0
! OSPF learned route 10.2.2.0/30 via 10.1.1.2, on GigabitEthernet0/0

     192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.1.0/24 is directly connected, GigabitEthernet0/1
! Directly connected network 192.168.1.0/24 on GigabitEthernet0/1
L       192.168.1.1/32 is directly connected, GigabitEthernet0/1
! Local interface address 192.168.1.1/32 on GigabitEthernet0/1
O    192.168.3.0/24 [110/3] via 10.1.1.2, 00:03:31, GigabitEthernet0/0
! OSPF learned route 192.168.3.0/24 via 10.1.1.2, on GigabitEthernet0/0

